Zarh/ManaGunZ/MGZ/lib/fatfs/ffsample/lpc176x/mmc_176x_ssp.c
	ty = 0;
	if (send_cmd(CMD0, 0) == 1) {			/* Put the card SPI state */
		Timer1 = 1000;						/* Initialization timeout = 1 sec */
		if (send_cmd(CMD8, 0x1AA) == 1) {	/* Is the catd SDv2? */
			for (n = 0; n < 4; n++) ocr[n] = xchg_spi(0xFF);	/* Get 32 bit return value of R7 resp */
			if (ocr[2] == 0x01 && ocr[3] == 0xAA) {				/* Does the card support 2.7-3.6V? */
				while (Timer1 && send_cmd(ACMD41, 1UL << 30)) ;	/* Wait for end of initialization with ACMD41(HCS) */
				if (Timer1 && send_cmd(CMD58, 0) == 0) {		/* Check CCS bit in the OCR */
					for (n = 0; n < 4; n++) ocr[n] = xchg_spi(0xFF);
					ty = (ocr[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;	/* Check if the card is SDv2 */
				}
			}
		} else {	/* Not an SDv2 card */
			if (send_cmd(ACMD41, 0) <= 1) 	{	/* SDv1 or MMCv3? */
				ty = CT_SD1; cmd = ACMD41;	/* SDv1 (ACMD41(0)) */
			} else {
				ty = CT_MMC; cmd = CMD1;	/* MMCv3 (CMD1(0)) */
			}
			while (Timer1 && send_cmd(cmd, 0)) ;		/* Wait for the card leaves idle state */
			if (!Timer1 || send_cmd(CMD16, 512) != 0)	/* Set block length: 512 */
				ty = 0;
		}
	}
	CardType = ty;	/* Card type */
	deselect();

	if (ty) {		/* OK */
		FCLK_FAST();			/* Set fast clock */
		Stat &= ~STA_NOINIT;	/* Clear STA_NOINIT flag */
	} else {		/* Failed */
		power_off();
		Stat = STA_NOINIT;
	}

	return Stat;
}



/*-----------------------------------------------------------------------*/
/* Get disk status                                                       */
/*-----------------------------------------------------------------------*/

DSTATUS disk_status (
	BYTE drv		/* Physical drive number (0) */
)
{
#ifdef _DISK_IMAGE
	if (drv == _DISK_IMAGE) {
		if (f_lseek(&ImgFile, f_tell(&ImgFile)) != FR_OK) return STA_NOINIT;	/* Is the image file opened? */
		return (ImgFile.flag & FA_WRITE) ? 0 : STA_PROTECT;
	}
#endif
	if (drv != 0) return STA_NOINIT;	/* Supports only drive 0 */

	return Stat;	/* Return disk status */
}



/*-----------------------------------------------------------------------*/
/* Read sector(s)                                                        */
/*-----------------------------------------------------------------------*/

DRESULT disk_read (
	BYTE drv,		/* Physical drive number (0) */
	BYTE *buff,		/* Pointer to the data buffer to store read data */
	LBA_t sector,	/* Start sector number (LBA) */
	UINT count		/* Number of sectors to read (1..128) */
)
{
	BYTE cmd;
	DWORD sect = (DWORD)sector;

#ifdef _DISK_IMAGE
	if (drv == _DISK_IMAGE && count > 0) {
		if ((sector + count) * 512 > f_size(&ImgFile)) return RES_ERROR;	/* Is the range valid? */
		if (f_lseek(&ImgFile, sector * 512) != FR_OK) return RES_ERROR;		/* Sector offset in the image file */
		if (f_read(&ImgFile, buff, count * 512, &count) != FR_OK) return RES_ERROR;	/* Get sectors from the image file */
		return RES_OK;
	}
#endif
	if (drv != 0 || count == 0) return RES_PARERR;		/* Check parameter */
	if (Stat & STA_NOINIT) return RES_NOTRDY;	/* Check if drive is ready */
	if (!(CardType & CT_BLOCK)) sect *= 512;	/* LBA ot BA conversion (byte addressing cards) */

	cmd = count > 1 ? CMD18 : CMD17;			/*  READ_MULTIPLE_BLOCK : READ_SINGLE_BLOCK */
	if (send_cmd(cmd, sect) == 0) {
		do {
			if (!rcvr_datablock(buff, 512)) break;
			buff += 512;
		} while (--count);
		if (cmd == CMD18) send_cmd(CMD12, 0);	/* STOP_TRANSMISSION */
	}
	deselect();

	return count ? RES_ERROR : RES_OK;	/* Return result */
}



/*-----------------------------------------------------------------------*/
/* Write sector(s)                                                       */
/*-----------------------------------------------------------------------*/

DRESULT disk_write (
	BYTE drv,			/* Physical drive number (0) */
	const BYTE *buff,	/* Ponter to the data to write */
	LBA_t sector,		/* Start sector number (LBA) */
	UINT count			/* Number of sectors to write (1..128) */
)
{
	DWORD sect = (DWORD)sector;

#ifdef _DISK_IMAGE
	if (drv == _DISK_IMAGE && count > 0) {
		if (!(ImgFile.flag & FA_WRITE)) return RES_WRPRT;	/* Read-only image? */
		if ((sector + count) * 512 > f_size(&ImgFile)) return RES_ERROR;	/* Is the range valid? */
		if (f_lseek(&ImgFile, sector * 512) != FR_OK) return RES_ERROR;		/* Sector offset in the image file */
		if (f_write(&ImgFile, buff, count * 512, &count) != FR_OK) return RES_ERROR;	/* Put sectors into the file image */
		return RES_OK;
	}
#endif
	if (drv != 0 || count == 0) return RES_PARERR;		/* Check parameter */
	if (Stat & STA_NOINIT) return RES_NOTRDY;	/* Check drive status */
	if (Stat & STA_PROTECT) return RES_WRPRT;	/* Check write protect */

	if (!(CardType & CT_BLOCK)) sect *= 512;	/* LBA ==> BA conversion (byte addressing cards) */

	if (count == 1) {	/* Single sector write */
		if ((send_cmd(CMD24, sect) == 0)	/* WRITE_BLOCK */
			&& xmit_datablock(buff, 0xFE)) {
			count = 0;
		}
	}
	else {				/* Multiple sector write */
		if (CardType & CT_SDC) send_cmd(ACMD23, count);	/* Predefine number of sectors */
		if (send_cmd(CMD25, sect) == 0) {	/* WRITE_MULTIPLE_BLOCK */
			do {
				if (!xmit_datablock(buff, 0xFC)) break;
				buff += 512;
			} while (--count);
			if (!xmit_datablock(0, 0xFD)) count = 1;	/* STOP_TRAN token */
		}
	}
	deselect();

	return count ? RES_ERROR : RES_OK;	/* Return result */
}


/*-----------------------------------------------------------------------*/
/* Miscellaneous drive controls other than data read/write               */
/*-----------------------------------------------------------------------*/

DRESULT disk_ioctl (
	BYTE drv,		/* Physical drive number (0) */
	BYTE cmd,		/* Control command code */
	void *buff		/* Pointer to the conrtol data */
)
{
	DRESULT res = RES_ERROR;
	BYTE n, csd[16], *ptr = buff;
	DWORD st, ed, csize;
	LBA_t *dp;
#if _DISKIO_ISDIO
	SDIO_CMD *sdio = buff;
	BYTE rc, *buf;
	UINT dc;
#endif


#ifdef _DISK_IMAGE
	if (drv == _DISK_IMAGE) {
		switch (cmd) {
		case CTRL_SYNC:
			res = RES_OK;
			break;
		case GET_SECTOR_COUNT:
			if (f_lseek(&ImgFile, f_tell(&ImgFile)) == FR_OK) {
				*(LBA_t*)buff = f_size(&ImgFile) / 512;
				res = RES_OK;
			}
			break;
		case GET_BLOCK_SIZE:
			*(DWORD*)buff = 1;
			res = RES_OK;
			break;
		case CTRL_OPEN_IMAGE_RO:
			res = f_open(&ImgFile, buff, FA_READ) == FR_OK ? RES_OK : RES_ERROR;
			break;
		case CTRL_OPEN_IMAGE_RW:
			res = f_open(&ImgFile, buff, FA_READ | FA_WRITE) == FR_OK ? RES_OK : RES_ERROR;
			break;
		case CTRL_CLOSE_IMAGE:
			res = f_close(&ImgFile) == FR_OK ? RES_OK : RES_ERROR;
			break;
		default:
			res = RES_PARERR;
		}
		return res;
	}
#endif
	if (drv != 0) return RES_PARERR;			/* Check parameter */
	if (Stat & STA_NOINIT) return RES_NOTRDY;	/* Check if drive is ready */

	switch (cmd) {
	case CTRL_SYNC:			/* Wait for end of internal write process of the drive */
		if (select()) res = RES_OK;
		break;

	case GET_SECTOR_COUNT:	/* Get drive capacity in unit of sector (DWORD) */
		if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {
			if ((csd[0] >> 6) == 1) {	/* SDC ver 2.00 */
				csize = csd[9] + ((WORD)csd[8] << 8) + ((DWORD)(csd[7] & 63) << 16) + 1;
				*(LBA_t*)buff = csize << 10;
			} else {					/* SDC ver 1.XX or MMC ver 3 */
				n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
				csize = (csd[8] >> 6) + ((WORD)csd[7] << 2) + ((WORD)(csd[6] & 3) << 10) + 1;
				*(LBA_t*)buff = csize << (n - 9);
			}
			res = RES_OK;
		}
		break;

